app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["name", "Chair"], ["description", "It has 4 legs"], ["updated_at", Wed, 11 Sep 2013 04:57:38 UTC +00:00]]
---
  def update
  	 @product = Product.find(params[:id])
  	 respond_to do |format|
	  	 if @product.update_attributes(product_params)

INSERT INTO "products" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 11 Sep 2013 18:17:57 UTC +00:00], ["description", ""], ["name", ""], ["updated_at", Wed, 11 Sep 2013 18:17:57 UTC +00:00]]
---
  def create
  	@product = Product.new(product_params)
  	respond_to do |format|
	  	if @product.save